package org.example.lesson24;


public class Tasks {

/**
 * 1.
 * - Создать класс Hero, представляющий героя и содержащий поле name;
 * - Добавить конструктор, принимающий имя героя и геттер для имени (сеттер не нужен)
 * - Добавить метод attackEnemy(), выводящий в консоль сообщение о том,
 * что герой атакует врага.
 * - Создзать класс TrainingGround, содержащий метод main. Протестировать
 * создание героя и его атаку.
 *
 * 2.
 * - Создать классы Warior, Mage, Archer, представляюще собой наследников
 * класса Hero.
 * - Переопределить в них метод attackEnemy() для вывода специализированного
 * для этого класса сообщения об атаке.
 * - Протестировать создание героев различных классов и их атаки в классе
 * TrainingGround;
 *
 * 3.
 * - Создать класс Enemy, представляющий собой врага и содержащий
 * поле health (количество здоровья).
 * - Добавить конструктор, принимающий количество зздоровья, а так же геттер и сеттер.
 * - Добавить метод takeDamage(), который уменьшает количество здоровья в соответствии
 * с полученным уроном.
 * - Переписать метод attackEnemy() класса Hero, добавив ему параметр типа Enemy.
 * Метод должен вызывать у врага метод takeDamage() и передавать в него определённое
 * количество урона.
 * - Переопределить метод в подклассах Warrior, Mage, Archer так, чтобы
 *
 *
 *
 */
}

